# EXERCISE 1

## Functions

In [4]:
def sayMyName():
    print("Blix")

In [5]:
sayMyName()

Blix

In [6]:
def mySurname(surname):
    print(surname)

In [7]:
mySurname("Foryasen")

Foryasen

In [8]:
def fullName(fname, lname):
    print(fname, lname)

In [9]:
fullName("Blix", "Foryasen")

Blix Foryasen

In [10]:
def completeName(*fullName):
    print("My fullname is ", fullName[0], fullName[1])
    print(fullName)

In [11]:
completeName("Blix", "Foryasen", "Larsson")

My fullname is  Blix Foryasen
('Blix', 'Foryasen', 'Larsson')

In [12]:
def mynumber(num:int):
    print("My number is ", num)

In [13]:
mynumber(10)

My number is  10

In [14]:
def myletter(letter:str) -> str:
    return letter

In [15]:
myletter('A')

'A'

## Lists

In [16]:
fruits = ['apple', 'banana', 'orange', 'lemon', 'grapes']

In [17]:
fruits

['apple', 'banana', 'orange', 'lemon', 'grapes']

In [18]:
for i in fruits:
    print(i)

apple
banana
orange
lemon
grapes

list comprehension

In [19]:
new_fruits = [fruit for fruit in fruits if 'e' in fruit]

In [20]:
new_fruits

['apple', 'orange', 'lemon', 'grapes']

## Map

In [21]:
mynumbers = [1, 2, 3, 4, 5]

In [22]:
def multiplybytwo(num):
    return num * 2

In [23]:
mynewnumbers = list(map(multiplybytwo, mynumbers))
mynewnumbers

[2, 4, 6, 8, 10]

## Lambda

In [24]:
answer = lambda x: x*7
print(answer(5))

35

## Pandas

In [25]:
import pandas as pd

In [30]:
df = pd.read_excel("data.xlsx")

In [31]:
df

   height  weight  age
0     165      63   20
1     178      65   20
2     178      79   20
3     151      42   19
4     175      85   21
5     165      69   20
6     169      55   20
7     173      58   19
8     163      74   20
9     148      70   21

In [32]:
df.head()

   height  weight  age
0     165      63   20
1     178      65   20
2     178      79   20
3     151      42   19
4     175      85   21

In [35]:
df.tail()

   height  weight  age
5     165      69   20
6     169      55   20
7     173      58   19
8     163      74   20
9     148      70   21

In [37]:
df.value_counts()

height  weight  age
148     70      21     1
151     42      19     1
163     74      20     1
165     63      20     1
        69      20     1
169     55      20     1
173     58      19     1
175     85      21     1
178     65      20     1
        79      20     1
Name: count, dtype: int64

In [40]:
df.drop_duplicates(inplace = True)

In [41]:
df.value_counts()

height  weight  age
148     70      21     1
151     42      19     1
163     74      20     1
165     63      20     1
        69      20     1
169     55      20     1
173     58      19     1
175     85      21     1
178     65      20     1
        79      20     1
Name: count, dtype: int64

In [42]:
df.iloc[0]

height    165
weight     63
age        20
Name: 0, dtype: int64

In [43]:
df.describe()

           height     weight        age
count   10.000000  10.000000  10.000000
mean   166.500000  66.000000  20.000000
std     10.458914  12.427568   0.666667
min    148.000000  42.000000  19.000000
25%    163.500000  59.250000  20.000000
50%    167.000000  67.000000  20.000000
75%    174.500000  73.000000  20.000000
max    178.000000  85.000000  21.000000

In [46]:
df.shape

(10, 3)

In [50]:
df.drop(columns=['age'], inplace = True)

In [51]:
df

   height  weight
0     165      63
1     178      65
2     178      79
3     151      42
4     175      85
5     165      69
6     169      55
7     173      58
8     163      74
9     148      70

## Matplotlib

In [38]:
import matplotlib.pyplot as plt